Autodesk.Revit.Exceptions.ArgumentNullException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.ArgumentNullException
The exception that is thrown when null is passed to a method that does not accept it as a valid argument.